*** TODO Get emacs-kbd-mode guix package
    :LOGBOOK:
    CLOCK: [2021-02-12 Fri 17:31]--[2021-02-12 Fri 17:34] =>  0:03
    :END:
****** TODO Write ret/lucky-search-git-repo
       :LOGBOOK:
       CLOCK: [2021-02-12 Fri 17:34]--[2021-02-12 Fri 18:00] =>  0:26
       :END:
***** Rewrite .org version and update .el version of config on killing
Maybe with that Rewrite step it's becames unnecesarily complicated to not just always tangle .org version on startup
   #+begin_src emacs-lisp
	  (use-package emacs
	    :config
	    (defun ret/rewrite-emacs-init-org ()
	      "Rewrite ret-emacs.org separate file version of Emacs literate configuration with content of its subheadings in life.org."
	      ;;cd hardpath
	      (find-file "~/life.org")
	      (let ((org-config-pos (org-find-entry-with-id "fb56955a-0683-4aa9-8ef7-b3a39ccb9ab7")))
		(goto-char org-config-pos)
		(org-copy-subtree)
		(with-temp-file "~/.config/emacs/ret-emacs.org"
		  (org-paste-subtree))))

	    (defun ret/delete-emacs-init-el ()
	      "Remove .el version of Emacs literate configuration if it exists"
	      (let ((config "~/.config/emacs/ret-emacs.el"))
		(when config
		  (delete-file config))))

	    (defun ret/update-literate-config ()
	      "Create up-to-date Emacs .org and .el configuration files on exit"
	      (ret/rewrite-emacs-init-org)
	      (ret/delete-emacs-init-el))
	    :hook (kill-emacs . ret/update-literate-config))

   #+end_src

   #+RESULTS:
   | org-babel-remove-temporary-directory | ret/update-literate-config |

**** Read about buffers in the manual [[info:emacs#Indirect Buffers][info:emacs#Indirect Buffers]]
Reading the title was sufficient
The `clone-indirect-buffer' does what i want
     :LOGBOOK:
     CLOCK: [2021-02-12 Fri 18:00]--[2021-02-12 Fri 18:05] =>  0:05
     :END:
